### iBGP 

### Цель:

* Настроить iBGP в офисе Москва
* Настроить iBGP в сети провайдера Триада
* Организовать полную IP связанность всех сетей

###  Задание:

1. Настроить iBGP в офисом Москва между маршрутизаторами R14 и R15.
2. Настроить iBGP в провайдере Триада, с использованием RR.
3. Настройть офис Москва так, чтобы приоритетным провайдером стал Ламас.
4. Настройть офис С.-Петербург так, чтобы трафик до любого офиса распределялся по двум линкам одновременно.
* Все сети в лабораторной работе должны иметь IP связность.


###  Решение:

1. [Настройка iBGP в офисом Москва между маршрутизаторами R14 и R15](Readme.md#1-настройка-ibgp-в-офисом-москва-между-маршрутизаторами-r14-и-r15)

2. [Настроить iBGP в провайдере Триада, с использованием RR](Readme.md#2-настроить-ibgp-в-провайдере-триада-с-использованием-rr)

3. [Настройть офис Москва так, чтобы приоритетным провайдером стал Ламас](Readme.md#3настройть-офис-москва-так-чтобы-приоритетным-провайдером-стал-ламас)

4. [Настройть офис С.-Петербург так, чтобы трафик до любого офиса распределялся по двум линкам одновременно](Readme.md#4настройть-офис-с-петербург-так-чтобы-трафик-до-любого-офиса-распределялся-по-двум-линкам-одновременно)


Ссылка на актуальную схему сети:

https://viewer.diagrams.net/?tags=%7B%7D&lightbox=1&highlight=0000ff&edit=_blank&layers=1&nav=1&title=Lab04.drawio#Uhttps%3A%2F%2Fraw.githubusercontent.com%2Ffueller-max%2Fdrawio%2Fmain%2FLab04.drawio

#### 1. Настройка iBGP в офисом Москва между маршрутизаторами R14 и R15.

Из практики iBGP обычно устанавливается между Loopback-интерфейсами для повышения доступности. Применим эту же стратегию для организации iBGP соседства  между R14 и R15 между Loopback интерфейсами.

Для начала убедимся, что есть сетевая связность по Loopback между R14, R15:

````
R14#ping 10.20.101.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.20.101.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms

````

```
R15#ping 10.20.100.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.20.100.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms
````

Стоит отметить, что сетевая связность внутри AS, в т.ч. по Loopback интерфейсам обеспечивается IGP, в данном случае OSPF.

Добавляем соседство на R14 с R15:

````
router bgp 1001
 bgp log-neighbor-changes
 neighbor 10.20.101.1 remote-as 1001
 neighbor 10.20.101.1 update-source Loopback0
````

Добавляем соседство на R15 с R14:

````
router bgp 1001
 bgp log-neighbor-changes
 neighbor 10.20.100.1 remote-as 1001
 neighbor 10.20.100.1 update-source Loopback0
````


Проверяем отношения соседства по BGP на роутере R14:

````
R14#sh ip bgp summary
BGP router identifier 10.20.100.1, local AS number 1001

Neighbor        V           AS MsgRcvd MsgSent   TblVer  InQ OutQ Up/Down  State/PfxRcd
10.20.101.1     4         1001       9      11        7    0    0 00:01:21        2
174.192.168.5   4          101      54      54        7    0    0 00:45:09        3
````

Проверяем отношения соседства по BGP на роутере R15:
````
R15#sh ip bgp summary

Neighbor        V           AS MsgRcvd MsgSent   TblVer  InQ OutQ Up/Down  State/PfxRc
10.20.100.1     4         1001      12      10        5    0    0 00:01:58        2
175.192.168.5   4          301      55      54        5    0    0 00:45:50        3
````

Как видно, у обоих роутеров отношения соседства как по eBGP(с соседними AS), так и iBGP(внутри одной AS) установлены.

Проверим передачу маршурутов:

````
R14#sh ip bgp

     Network          Next Hop            Metric LocPrf Weight Path
 *>  174.192.168.0/24 174.192.168.5            0             0 101 i
 *>i 175.192.168.0/24 175.192.168.5            0    100      0 301 i
 *                    174.192.168.5                          0 101 301 i
 * i 176.192.168.0/24 175.192.168.5            0    100      0 301 520 i
 *>                   174.192.168.5                          0 101 301 520 i
````

````
R15#sh ip bgp

     Network          Next Hop            Metric LocPrf Weight Path
 *>i 174.192.168.0/24 174.192.168.5            0    100      0 101 i
 *                    175.192.168.5                          0 301 101 i
 *>  175.192.168.0/24 175.192.168.5            0             0 301 i
 * i 176.192.168.0/24 174.192.168.5            0    100      0 101 301 520 i
 *>                   175.192.168.5                          0 301 520 i
````


Как видно, часть маршрутов передаются теперь по iBGP, но есть проблема в NexHop. Особенность iBGP в том, что он по умолчанию не меняет NexHop,
 а оставляет изначальный. Соотвественно, сосед по iBGP можует получить маршрут, до которого он не сможет дойти, т.к. адрес перехода ему не извествен.

Для устранения данной проблемы добавляем команду "Next-Hop-self" в конфигурации iBGP.

````
R14(config)#router bgp 1001
R14(config-router)#neighbor 10.20.101.1 Next-Hop-self
````

````
R15(config)#router bgp 1001
R15(config-router)# neighbor 10.20.100.1 Next-Hop-self
````

После этого, таблица маршрутизации BGP принимает след. вид:

````
R14#sh ip bgp

     Network          Next Hop            Metric LocPrf Weight Path
 *>  174.192.168.0/24 174.192.168.5            0             0 101 i
 *>i 175.192.168.0/24 10.20.101.1              0    100      0 301 i
 *                    174.192.168.5                          0 101 301 i
 *>i 176.192.168.0/24 10.20.101.1              0    100      0 301 520 i
 *                    174.192.168.5                          0 101 301 520 i
````
````
R15#sh ip bgp

     Network          Next Hop            Metric LocPrf Weight Path
 *>i 174.192.168.0/24 10.20.100.1              0    100      0 101 i
 *                    175.192.168.5                          0 301 101 i
 *>  175.192.168.0/24 175.192.168.5            0             0 301 i
 * i 176.192.168.0/24 10.20.100.1              0    100      0 101 301 520 i
 *>                   175.192.168.5                          0 301 520 i
````


Также еще добавим анонсы сетей офисов 10.20.0.0/16 для роутеров R14,R15 и 176.16.0.0/16 для R18 для передачи этих префиксов в eBGP и обеспечения связности всей сети.
Сейчас, например, связность между R14 и R18 нрарушена после запуска iBGP, т.к. R14 отправляет запросы до R18, через R15, через сеть 10.20.7.0/29. При получении пакета
 с источником 10.20.7.0/29 R18 не может ответить, т.к. данная сеть ему неизвестна.


На роутерах R14,R15 добавялем анонс сети и статический маршрут(без него сеть не будет анонсироваться в BGP):

````
router bgp 1001
 network 10.20.0.0 mask 255.255.0.0
````
````
ip route 10.20.0.0 255.255.0.0 Null0
````

На R18:
````
router bgp 2042
 network 176.16.0.0
````
````
ip route 176.16.0.0 255.255.0.0 Null0
````

Проверим таблицу маршрутизации на роутерах R18, R14,R15:

````
R18#sh ip bgp

     Network          Next Hop            Metric LocPrf Weight Path
 *   10.20.0.0/16     176.192.168.17                         0 520 301 1001 i
 *>                   176.192.168.13                         0 520 301 1001 i
 *   174.192.168.0/24 176.192.168.17                         0 520 301 101 i
 *>                   176.192.168.13                         0 520 301 101 i
 *   175.192.168.0/24 176.192.168.17                         0 520 301 i
 *>                   176.192.168.13                         0 520 301 i
 *>  176.16.0.0       0.0.0.0                  0         32768 i
 *   176.192.168.0/24 176.192.168.17           0             0 520 i
 *>                   176.192.168.13           0             0 520 i

````

````
R15#sh ip bgp
     Network          Next Hop            Metric LocPrf Weight Path
 *>  10.20.0.0/16     0.0.0.0                  0         32768 i
 * i                  10.20.100.1              0    100      0 i
 *   174.192.168.0/24 175.192.168.5                          0 301 101 i
 *>i                  10.20.100.1              0    100      0 101 i
 *>  175.192.168.0/24 175.192.168.5            0             0 301 i
 *>  176.16.0.0       175.192.168.5                          0 301 520 2042 i
 *>  176.192.168.0/24 175.192.168.5                          0 301 520 i
````
````
R14#sh ip bgp
     Network          Next Hop            Metric LocPrf Weight Path
 * i 10.20.0.0/16     10.20.101.1              0    100      0 i
 *>                   0.0.0.0                  0         32768 i
 *>  174.192.168.0/24 174.192.168.5            0             0 101 i
 r>i 175.192.168.0/24 10.20.101.1              0    100      0 301 i
 r                    174.192.168.5                          0 101 301 i
 r>i 176.16.0.0       10.20.101.1              0    100      0 301 520 2042 i
 r                    174.192.168.5                          0 101 301 520 2042 i
 r>i 176.192.168.0/24 10.20.101.1              0    100      0 301 520 i
 r                    174.192.168.5                          0 101 301 520 i

````

Проверим связность между R14,R15 и R18:


````
R15#ping 176.192.168.14
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 176.192.168.14, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/2 ms
````

````
R14#ping 176.192.168.14
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 176.192.168.14, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms
````

Обратим внимание на прохождение пути от R14 до R18:

````
R14#traceroute 176.192.168.14
Type escape sequence to abort.
Tracing the route to 176.192.168.14
VRF info: (vrf in name/id, vrf out name/id)
  1 10.20.7.2 1 msec 1 msec 0 msec
  2 175.192.168.5 [AS 301] 1 msec 3 msec 1 msec
  3 176.192.168.9 [AS 520] 2 msec 2 msec 0 msec
  4 176.192.168.14 [AS 520] 1 msec 1 msec *
````

Теперь пакеты ходят через R15, т.е первый переход происходит в рамках своей AS, что было достигнуто за счет настройки iBGP. 

#### 2. Настроить iBGP в провайдере Триада, с использованием RR

При настройке iBGP в офисе будем также использовать сессии на Loopback, а также будем использовать RR (Route Reflector), в качестве которого выберем R24.

Для начала проверим доступность looback интерфейсов роутеров R23,R25,R26 c R24(ответственность IS-IS протокола).

````
R24#ping 10.60.100.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.60.100.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms
R24#ping 10.60.101.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.60.101.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms
R24#ping 10.60.103.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.60.103.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms
````

В настройках R23, R25, R26 поднимаем iBGP сессии с одним соседом R24(RR).

Также анонсируем подключенные к этим роутерам внешние сети c другими офисами.

````
R23#sh run | sec bgp
router bgp 520
 bgp log-neighbor-changes
 network 176.192.168.4 mask 255.255.255.252
 neighbor 10.60.102.1 remote-as 520
 neighbor 10.60.102.1 update-source Loopback0
 neighbor 10.60.102.1 next-hop-self
````

````
R25#sh run | sec bgp
router bgp 520
 bgp log-neighbor-changes
 network 176.192.168.24 mask 255.255.255.252
 network 176.192.168.28 mask 255.255.255.252
 neighbor 10.60.102.1 remote-as 520
 neighbor 10.60.102.1 update-source Loopback0
 neighbor 10.60.102.1 next-hop-self
````

````
R26#sh run | sec bgp
router bgp 520
 bgp log-neighbor-changes
 network 176.192.168.0 mask 255.255.255.0
 network 176.192.168.16 mask 255.255.255.252
 network 176.192.168.20 mask 255.255.255.252
 neighbor 10.60.102.1 remote-as 520
 neighbor 10.60.102.1 update-source Loopback0
 neighbor 10.60.102.1 next-hop-self
 neighbor 176.192.168.18 remote-as 2042
````

В настройах R24 (RR) указываем роутеры как RR клиенты.

````
R24#sh run | sec bgp
router bgp 520
 bgp log-neighbor-changes
 network 176.192.168.0 mask 255.255.255.0
 neighbor 10.60.100.1 remote-as 520
 neighbor 10.60.100.1 route-reflector-client
 neighbor 10.60.100.1 next-hop-self
 neighbor 10.60.101.1 remote-as 520
 neighbor 10.60.101.1 route-reflector-client
 neighbor 10.60.101.1 next-hop-self
 neighbor 10.60.103.1 remote-as 520
 neighbor 10.60.103.1 route-reflector-client
 neighbor 10.60.103.1 next-hop-self
 neighbor 176.192.168.10 remote-as 301
 neighbor 176.192.168.14 remote-as 2042
````

Проверям получение маршрутов от RR на роутерах R23,R25,R26:

````
R23#sh ip bgp

     Network          Next Hop            Metric LocPrf Weight Path
 *>i 10.20.0.0/16     10.60.102.1              0    100      0 301 1001 i
 *>i 174.192.168.0/24 10.60.102.1              0    100      0 301 101 i
 *>i 175.192.168.0/24 10.60.102.1              0    100      0 301 i
 *>i 176.16.0.0       10.60.103.1              0    100      0 2042 i
 *>i 176.192.168.0/24 10.60.102.1              0    100      0 i
 *>  176.192.168.4/30 0.0.0.0                  0         32768 i
 *>i 176.192.168.16/30
                       10.60.103.1              0    100      0 i
 *>i 176.192.168.20/30
                       10.60.103.1              0    100      0 i
 *>i 176.192.168.24/30
                       10.60.101.1              0    100      0 i
 *>i 176.192.168.28/30
                       10.60.101.1              0    100      0 i

````

````
R25#sh ip bgp
     Network          Next Hop            Metric LocPrf Weight Path
 *>i 10.20.0.0/16     10.60.102.1              0    100      0 301 1001 i
 *>i 174.192.168.0/24 10.60.102.1              0    100      0 301 101 i
 *>i 175.192.168.0/24 10.60.102.1              0    100      0 301 i
 *>i 176.16.0.0       10.60.103.1              0    100      0 2042 i
 *>i 176.192.168.0/24 10.60.102.1              0    100      0 i
 *>i 176.192.168.4/30 10.60.100.1              0    100      0 i
 *>i 176.192.168.16/30
                       10.60.103.1              0    100      0 i
 *>i 176.192.168.20/30
                       10.60.103.1              0    100      0 i
 *>  176.192.168.24/30
                       0.0.0.0                  0         32768 i
 *>  176.192.168.28/30
                       0.0.0.0                  0         32768 i
````

````
R26#sh ip bgp
     Network          Next Hop            Metric LocPrf Weight Path
 *>i 10.20.0.0/16     10.60.102.1              0    100      0 301 1001 i
 *>i 174.192.168.0/24 10.60.102.1              0    100      0 301 101 i
 *>i 175.192.168.0/24 10.60.102.1              0    100      0 301 i
 *>  176.16.0.0       176.192.168.18           0             0 2042 i
 * i 176.192.168.0/24 10.60.102.1              0    100      0 i
 *>                   0.0.0.0                  0         32768 i
 *>i 176.192.168.4/30 10.60.100.1              0    100      0 i
 *>  176.192.168.16/30
                       0.0.0.0                  0         32768 i
 *>  176.192.168.20/30
                       0.0.0.0                  0         32768 i
 *>i 176.192.168.24/30
                       10.60.101.1              0    100      0 i
 *>i 176.192.168.28/30
````

И таблица на R24 (RR):

````
     Network          Next Hop            Metric LocPrf Weight Path
 *>  10.20.0.0/16     176.192.168.10                         0 301 1001 i
 *>  174.192.168.0/24 176.192.168.10                         0 301 101 i
 *>  175.192.168.0/24 176.192.168.10           0             0 301 i
 *>i 176.16.0.0       10.60.103.1              0    100      0 2042 i
 * i 176.192.168.0/24 10.60.103.1              0    100      0 i
 *>                   0.0.0.0                  0         32768 i
 *>i 176.192.168.4/30 10.60.100.1              0    100      0 i
 *>i 176.192.168.16/30
                       10.60.103.1              0    100      0 i
 *>i 176.192.168.20/30
                       10.60.103.1              0    100      0 i
 *>i 176.192.168.24/30
                       10.60.101.1              0    100      0 i
 *>i 176.192.168.28/30
                       10.60.101.1              0    100      0 i
````

Как видно, за счет наличия RR роутера маршруты распостраняются по всем роутрерам по схеме клиент-среверной схеме.


#### 3.Настройть офис Москва так, чтобы приоритетным провайдером стал Ламас


На данный момент весь трафик и так будет идти через Ламас:

````
R14>sh ip bgp

     Network          Next Hop            Metric LocPrf Weight Path
 * i 10.20.0.0/16     10.20.101.1              0    100      0 i
 *>                   0.0.0.0                  0         32768 i
 *>  174.192.168.0/24 174.192.168.5            0             0 101 i
 r>i 175.192.168.0/24 10.20.101.1              0    100      0 301 i
 r                    174.192.168.5                          0 101 301 i
 r>i 176.16.0.0       10.20.101.1              0    100      0 301 520 2042 i
 r                    174.192.168.5                          0 101 301 520 2042 i
 r>i 176.192.168.0/24 10.20.101.1              0    100      0 301 520 i
 r                    174.192.168.5                          0 101 301 520 i
 r>i 176.192.168.4/30 10.20.101.1              0    100      0 301 520 i
 r                    174.192.168.5                          0 101 301 520 i
 r   176.192.168.16/30
                       174.192.168.5                          0 101 301 520 i
 r>i                  10.20.101.1              0    100      0 301 520 i
 r>i 176.192.168.20/30
                       10.20.101.1              0    100      0 301 520 i
 r                    174.192.168.5                          0 101 301 520 i
 r   176.192.168.24/30
                       174.192.168.5                          0 101 301 520 i
 r>i                  10.20.101.1              0    100      0 301 520 i
 r>i 176.192.168.28/30
                       10.20.101.1              0    100      0 301 520 i
 r                    174.192.168.5                          0 101 301 520 i

````

Добавим eBGP соседство между Китроном и Триада (олустим настройку - она стандартная для eBGP), для того, чтобы появлися альтернативный путь через Китрон
и снова проверим  таблицу для R14:

````
R14#sh ip bgp

     Network          Next Hop            Metric LocPrf Weight Path
 * i 10.20.0.0/16     10.20.101.1              0    100      0 i
 *>                   0.0.0.0                  0         32768 i
 *>  174.192.168.0/24 174.192.168.5            0             0 101 i
 r   175.192.168.0/24 174.192.168.5                          0 101 301 i
 r>i                  10.20.101.1              0    100      0 301 i
 *>  176.16.0.0       174.192.168.5                          0 101 520 2042 i
 * i                  10.20.101.1              0    100      0 301 520 2042 i
 *>  176.192.168.0/24 174.192.168.5                          0 101 520 i
 * i                  10.20.101.1              0    100      0 301 520 i
 *>  176.192.168.4/30 174.192.168.5                          0 101 520 i
 * i                  10.20.101.1              0    100      0 301 520 i
 *>  176.192.168.16/30
                       174.192.168.5                          0 101 520 i
 * i                  10.20.101.1              0    100      0 301 520 i
 *>  176.192.168.20/30
                       174.192.168.5                          0 101 520 i
 * i                  10.20.101.1              0    100      0 301 520 i
 *>  176.192.168.24/30
                       174.192.168.5                          0 101 520 i
 * i                  10.20.101.1              0    100      0 301 520 i
 *>  176.192.168.28/30
                       174.192.168.5                          0 101 520 i
 * i                  10.20.101.1              0    100      0 301 520 i
````

Как видим, теперь весь трафик от R14 до внешних сетей будет идти через Китрон(ctnm 174.192...), по пути 1001 -> 101 -> ...

Для того, чтобы направить трафик от R14 через R15 и далее Ламас, используем один из подходов для манипуляции выбора пути BGP, а именно установки 
атрбиута Local Preference, который чем выше, тем более приоритетным считается путь.

Установим в BGP дефолтную Local Preference для R14 - 150, а для R15 - 200. При этом те маршруты, которые мы будем получать с R15 будут иметь более высокий приоритет.

````
R14(config-router)#do sh run | sec bgp
router bgp 1001
 bgp log-neighbor-changes
 bgp default local-preference 150

....
R15(config-router)#do sh run | sec bgp
 redistribute bgp 1001 subnets
router bgp 1001
 bgp log-neighbor-changes
 bgp default local-preference 200
 ....

````

Проверям маршруты BGP для роутера R14:

````
     Network          Next Hop            Metric LocPrf Weight Path
 * i 10.20.0.0/16     10.20.101.1              0    200      0 i
 *>                   0.0.0.0                  0         32768 i
 r>i 174.192.168.0/24 10.20.101.1              0    200      0 301 101 i
 r                    174.192.168.5            0             0 101 i
 *>  175.192.168.0/24 174.192.168.5                          0 101 301 i
 * i                  10.20.101.1              0    100      0 301 i
 r   176.16.0.0       174.192.168.5                          0 101 520 2042 i
 r>i                  10.20.101.1              0    200      0 301 520 2042 i
 r   176.192.168.0/24 174.192.168.5                          0 101 520 i
 r>i                  10.20.101.1              0    200      0 301 520 i
 r   176.192.168.4/30 174.192.168.5                          0 101 520 i
 r>i                  10.20.101.1              0    200      0 301 520 i
 r   176.192.168.16/30
                       174.192.168.5                          0 101 520 i
 r>i                  10.20.101.1              0    200      0 301 520 i
 r   176.192.168.20/30
                       174.192.168.5                          0 101 520 i
 r>i                  10.20.101.1              0    200      0 301 520 i
 r   176.192.168.24/30
                       174.192.168.5                          0 101 520 i
 r>i                  10.20.101.1              0    200      0 301 520 i
 r   176.192.168.28/30
                       174.192.168.5                          0 101 520 i
 r>i                  10.20.101.1              0    200      0 301 520 i

````

Видим, что все маршурты во внешние сети, полученные от R15 теперь имеют Local Preference 200 и именно они выбираются приоритетными.

Проверим путь трафика до Санкт-Петербруга с роутера R14:

````
R14#traceroute 176.192.168.14
Type escape sequence to abort.
Tracing the route to 176.192.168.14
VRF info: (vrf in name/id, vrf out name/id)
  1 10.20.7.2 1 msec 1 msec 0 msec
  2 175.192.168.5 [AS 301] 0 msec 1 msec 2 msec
  3 176.192.168.9 [AS 520] 1 msec 4 msec 2 msec
  4 176.192.168.14 [AS 520] 4 msec 6 msec *

````

Как видим, трафик идет через R15 и далее через AS301 - Ламас.

#### 4.Настройть офис С.-Петербург так, чтобы трафик до любого офиса распределялся по двум линкам одновременно.


Проверим таблицу маршрутов BGP для роутера R18. 

````
R18#sh ip bgp
....

     Network          Next Hop            Metric LocPrf Weight Path
 *>  10.20.0.0/16     176.192.168.13                         0 520 301 1001 i
 *                    176.192.168.17                         0 520 301 1001 i
 *>  174.192.168.0/24 176.192.168.13                         0 520 101 i
 *                    176.192.168.17                         0 520 101 i
 *>  175.192.168.0/24 176.192.168.13                         0 520 301 i
 *                    176.192.168.17                         0 520 301 i
 *>  176.16.0.0       0.0.0.0                  0         32768 i
 *>  176.192.168.0/24 176.192.168.13           0             0 520 i
 *                    176.192.168.17           0             0 520 i
 *>  176.192.168.4/30 176.192.168.13                         0 520 i
 *                    176.192.168.17                         0 520 i
 r>  176.192.168.16/30
                       176.192.168.13                         0 520 i
 r                    176.192.168.17           0             0 520 i
 *>  176.192.168.20/30
                       176.192.168.13                         0 520 i
 *                    176.192.168.17           0             0 520 i
 *>  176.192.168.24/30
                       176.192.168.13                         0 520 i
 *                    176.192.168.17                         0 520 i
 *>  176.192.168.28/30
                       176.192.168.13                         0 520 i
 *                    176.192.168.17                         0 520 i
````

Видно, что путь до внешних сетей лежит на линке 176.192.168.13 - роутер R24 провайдера Триада. 
Задача сделать так, что бы трафик распределялся между линками 176.192.168.13 и 176.192.168.17, соотвественно роутерами R24 и R26.

По умолчанию, BGP выбирает один лучший путь на основании анализа Best Bath и его использует для передачи трафика. 

В данной схеме для роутера R18 мы можем использовать параметр "maximum-paths" для балансировки трафика по двум линкам от одного роутра к двум другим.

````
R18#sh run | sec bgp
router bgp 2042
 bgp log-neighbor-changes
 network 172.16.100.1 mask 255.255.255.255
 network 176.16.0.0
 neighbor 176.192.168.13 remote-as 520
 neighbor 176.192.168.17 remote-as 520
 maximum-paths 2
````

Проверям маршрутизацию на роутере R18:

````
R18#sh ip route
Gateway of last resort is 0.0.0.0 to network 0.0.0.0

D*    0.0.0.0/0 is a summary, 03:49:46, Null0
      10.0.0.0/16 is subnetted, 1 subnets
B        10.20.0.0 [20/0] via 176.192.168.17, 00:00:29
                   [20/0] via 176.192.168.13, 00:00:29
      172.16.0.0/16 is variably subnetted, 5 subnets, 2 masks
C        172.16.1.0/29 is directly connected, Ethernet0/1
L        172.16.1.1/32 is directly connected, Ethernet0/1
C        172.16.2.0/29 is directly connected, Ethernet0/0
L        172.16.2.1/32 is directly connected, Ethernet0/0
C        172.16.100.1/32 is directly connected, Loopback0
      174.192.0.0/24 is subnetted, 1 subnets
B        174.192.168.0 [20/0] via 176.192.168.17, 00:00:29
                       [20/0] via 176.192.168.13, 00:00:29
      175.192.0.0/24 is subnetted, 1 subnets
B        175.192.168.0 [20/0] via 176.192.168.17, 00:00:29
                       [20/0] via 176.192.168.13, 00:00:29
S     176.16.0.0/16 is directly connected, Null0
      176.192.0.0/16 is variably subnetted, 9 subnets, 3 masks
B        176.192.168.0/24 [20/0] via 176.192.168.17, 00:00:29
                          [20/0] via 176.192.168.13, 00:00:29
B        176.192.168.4/30 [20/0] via 176.192.168.17, 00:00:29
                          [20/0] via 176.192.168.13, 00:00:29
C        176.192.168.12/30 is directly connected, Ethernet0/2
L        176.192.168.14/32 is directly connected, Ethernet0/2
C        176.192.168.16/30 is directly connected, Ethernet0/3
L        176.192.168.18/32 is directly connected, Ethernet0/3
B        176.192.168.20/30 [20/0] via 176.192.168.17, 00:00:29
                           [20/0] via 176.192.168.13, 00:00:29
B        176.192.168.24/30 [20/0] via 176.192.168.17, 00:00:29
                           [20/0] via 176.192.168.13, 00:00:29
B        176.192.168.28/30 [20/0] via 176.192.168.17, 00:00:29
                           [20/0] via 176.192.168.13, 00:00:29

````

Как видно, для внешних сетей появлись записи вида:
````
B        176.192.168.0/24 [20/0] via 176.192.168.17, 00:00:29
                          [20/0] via 176.192.168.13, 00:00:29
````
что говорит о том, что есть два альтратвных пути.

также в роутах BGP появились отметки о  multipath:

````
R18#sh ip bgp

     Network          Next Hop            Metric LocPrf Weight Path
 *>  10.20.0.0/16     176.192.168.13                         0 520 301 1001 i
 *m                   176.192.168.17                         0 520 301 1001 i
 *>  174.192.168.0/24 176.192.168.13                         0 520 101 i
 *m                   176.192.168.17                         0 520 101 i
 *>  175.192.168.0/24 176.192.168.13                         0 520 301 i
 *m                   176.192.168.17                         0 520 301 i
 *>  176.16.0.0       0.0.0.0                  0         32768 i
 *>  176.192.168.0/24 176.192.168.13           0             0 520 i
 *m                   176.192.168.17           0             0 520 i
 *>  176.192.168.4/30 176.192.168.13                         0 520 i
 *m                   176.192.168.17                         0 520 i
 r>  176.192.168.16/30
                       176.192.168.13                         0 520 i
 rm                   176.192.168.17           0             0 520 i
 *>  176.192.168.20/30
                       176.192.168.13                         0 520 i
 *m                   176.192.168.17           0             0 520 i
 *>  176.192.168.24/30
                       176.192.168.13                         0 520 i
 *m                   176.192.168.17                         0 520 i
 *>  176.192.168.28/30
                       176.192.168.13                         0 520 i
 *m                   176.192.168.17                         0 520 i
````

Сделем tracerpoute до внешнего адреса:

````
R18#traceroute 176.192.168.9
Type escape sequence to abort.
Tracing the route to 176.192.168.9
VRF info: (vrf in name/id, vrf out name/id)
  1 176.192.168.13 [AS 520] 1 msec *  2 msec
R18#traceroute 176.192.168.9 source Loopback0
Type escape sequence to abort.
Tracing the route to 176.192.168.9
VRF info: (vrf in name/id, vrf out name/id)
  1 176.192.168.17 [AS 520] 0 msec
    176.192.168.13 [AS 520] 1 msec
    176.192.168.17 [AS 520] 0 msec
````

Как видно по результатам работы traceroute трафик распределяется между линками 176.192.168.17 и 176.192.168.13, т.е. осуществляется балансировка трафика между R18 
и провайдером Триада.

Актуальные конфиги устройств помещены в папку  configs.

